{
  "WELCOME": "¡Bienvenido!",
  "DOWNLOAD_CV": "Descargar CV",
  "HELLO": "¡Hola! Soy Ignacio Navarrete",
  "INTRO_TEXT": "Mi especialización en desarrollo frontend avanzado con Angular me ha permitido contribuir significativamente al éxito de numerosos proyectos. He dominado esta tecnología clave para la creación de aplicaciones web modernas e intuitivas.",
  "WORK_EXPERIENCE": "Experiencia laboral",
  "FRONTEND_DEVELOPER": "Desarrollador frontend especializado en Angular",
  "EXCITED_OPPORTUNITIES": "Estoy emocionado por nuevas oportunidades para colaborar en proyectos desafiantes y contribuir al éxito de equipos dinámicos. Si estás buscando un profesional comprometido y apasionado por la innovación en el desarrollo de software web, me encantaría ser parte de tu equipo.",
  "SKILLS": "Principales habilidades",
  "TOOLS": "Herramientas",
  "PROCETTI_TITLE": "Desarrollador de front-end angular",
  "PROCETTI_TIME_PERIOD": "Agosto. 2024 - Actualidad",
  "PROCETTI_DESCRIPTION_1": "Reorganización de la Estructura del Proyecto: Creación de carpetas específicas para cada tipo de archivo, incluyendo páginas, guards, enums, interfaces, helpers, componentes, pipes y servicios. Esto ha permitido una mayor claridad y eficiencia en la gestión del código.",
  "PROCETTI_DESCRIPTION_2": "Eliminación de Código Repetido: He optimizado el rendimiento de la aplicación al eliminar código redundante, lo que resultó en una mejora significativa en la estabilidad y la eficiencia general del proyecto.",
  "PROCETTI_DESCRIPTION_3": "Refactorización de Interfaces y Métodos: Renombré y estructuré interfaces, enums, constantes, métodos y funciones para asegurar que cada uno tenga una única responsabilidad, organizándolos en archivos más específicos.",
  
  "NEORIS_TITLE": "Desarrollador de front-end angular",
  "NEORIS_TIME_PERIOD": "2 años abr. 2022 - mar. 2024",
  "NEORIS_DESCRIPTION_1": "Participé más de un año en Cemex como Desarrollador frontend encargado de implementar nuevas características y mejoras para el área de cemento. Colaboré en nuevas características para UK, GB y CZ en el proceso de envío de pedidos online. Para CZ, creé la configuración base como objetos predefinidos, adhiriéndome a los patrones del proyecto para el correcto funcionamiento y las mejores prácticas de desarrollo, constantemente haciendo pull a las historias de usuario para avanzar en el desarrollo.",
  "NEORIS_DESCRIPTION_2": "Trabajé en Angular 7 utilizando NGRX, usando acciones, reducers, selectors y effects, y también utilicé Angular RxJS para la manipulación de datos. Considero que es un proyecto robusto, altamente configurable, adaptable y estable. Atendí bugs de desarrollo enfocados en el frontend para estos países. Acostumbrado a usar el tablero Kanban para el flujo ágil de tareas y seguimiento.",
  
  "NOVA_TITLE": "Desarrollador front end en Sr",
  "NOVA_TIME_PERIOD": "nov 2021 - abril 2022",
  "NOVA_DESCRIPTION_1": "Participé en el proyecto de Bursanet de Actinver, una migración de AngularJS a Angular 12. Apoyé creando el código base y agregando un widget dinámico que controlaba y monitoreaba ETFs y sus cotizaciones en la bolsa. Desarrollé componentes y módulos y utilicé servicios de Angular.",
  "NOVA_DESCRIPTION_2": "Trabajé en equipo y cédulas para mayor rendimiento. Utilicé Figma para la revisión del diseño y maquetación, GitLab para la gestión de repositorios. Trabajé con los principios del desarrollo ágil (SCRUM) para sprints cortos y resultados visibles, con una sólida comprensión de los procesos de desarrollo.",
  
  "RELAPPRO_TITLE": "Desarrollador front end",
  "RELAPPRO_TIME_PERIOD": "octubre 2017 - septiembre 2021",
  "RELAPPRO_DESCRIPTION_1": "Apoyé en el desarrollo desde cero, ayudando a aumentar las ganancias de la empresa con el apoyo de un panel de administración. Trabajé en el lado del frontend, el proyecto estaba relacionado con la publicidad a través de etiquetas de Google e implicaba mantener toda la información sobre agencias, campañas, publishers, pagos, usuarios, sitios, proveedores, ingresos, una lista negra de sitios, subir videos, facturación, gráficos y creación y manipulación de etiquetas. Todo el panel fue construido en Angular y Angular Material en la v8. Actualmente sigue funcionando de forma independiente gracias al script construido en TypeScript, que mejoramos hasta llegar a la v5, una versión estable y rápida.",
  
  "SIMETRICAL_TITLE": "Desarrollador Web PHP",
  "SIMETRICAL_TIME_PERIOD": "marzo 2016 - octubre 2017",
  "SIMETRICAL_DESCRIPTION_1": "Participé más de un año en Cemex como Desarrollador frontend encargado de implementar nuevas características y mejoras para el área de cemento. Colaboré en nuevas características para UK, GB y CZ en el proceso de envío de pedidos online. Para CZ, creé la configuración base como objetos predefinidos, adhiriéndome a los patrones del proyecto para el correcto funcionamiento y las mejores prácticas de desarrollo, constantemente haciendo pull a las historias de usuario para avanzar en el desarrollo.",
  "SIMETRICAL_DESCRIPTION_2": "Trabajé en Angular 7 utilizando NGRX, usando acciones, reducers, selectors y effects, y también utilicé Angular RxJS para la manipulación de datos. Considero que es un proyecto robusto, altamente configurable, adaptable y estable. Atendí bugs de desarrollo enfocados en el frontend para estos países. Acostumbrado a usar el tablero Kanban para el flujo ágil de tareas y seguimiento.",
  
  "EFISENSE_TITLE": "Desarrollador PHP back end",
  "EFISENSE_TIME_PERIOD": "Enero 2014 - abril 2015",
  "EFISENSE_DESCRIPTION_1": "Desarrollador de la parte visual de sitios y sistemas de la empresa, así como proponer alternativas en diseño de Interfaces y experiencia de usuario. Maquetación y diseño responsivo web para la visualización de múltiples dispositivos así como contar con conocimiento de Material Design y AngularJS.",
  "EFISENSE_DESCRIPTION_2": "Desarrollador y programador web trabajando en diferentes proyectos de la empresa ofreciendo de igual manera soporte y asistencia en línea. Desarrollé módulos y actualizaciones de los sistemas existentes. Otorgue soporte y mantenimiento a los equipos que los clientes soliciten."
}
